app/Controllers/Alumno.php

SELECT *
FROM `Alumnos`
WHERE `num_control` = '87654321'
AND `id_alumno` NOT IN ('11')
 LIMIT 1
---
    private function _validateData(){

        $check_unique_num_control = function (){

            // Obtenemos los datos
            $numControl = $this->request->getPost("numControl");
            $id = $this->request->getPost("id");

            // Verifica si el número de control ya existe en la base de datos
            $this->AlumnoModel->where('num_control', $numControl);

            // Si estamos actualizando, excluye el registro actual
            if (!empty($id)) {
                $this->AlumnoModel->whereNotIn('id_alumno', [$id]);
            }

            $result = $this->AlumnoModel->first();