app/Models/AlumnoModel.php

INSERT INTO `Alumnos` (`nombre`, `num_control`, `id_carrera`, `semestre`, `id_grupo`) VALUES ('Jose Manuel', '12345678', '3', '4', '17')
---
    public function insertData($data){
        return $this->insert($data);

UPDATE `Alumnos` SET `nombre` = 'Juan', `num_control` = '87654321', `id_carrera` = '5', `semestre` = '4', `id_grupo` = '31'
WHERE `Alumnos`.`id_alumno` IN ('11')
---
    public function updateData($id, $data){
        return $this->update($id, $data);