app/Models/CarrerasModel.php

    public function getAll()
    {
        return $this->findAll();
---
SELECT *
FROM `Carreras`