app/Models/GruposModel.php

    public function get_by($id_carrera, $semestre){
        return $this->where('id_carrera', $id_carrera)
                    ->where('semestre', $semestre)
                    ->findAll();
---
SELECT *
FROM `Grupos`
WHERE `id_carrera` = '3'
AND `semestre` = '2'